SCRIPT_LIST = {
"unknown" : ("죄송합니다. 잘 모르겠어요.", "죄송합니다. 정확한 요구 사항이 필요해요!", "죄송합니다. 다시 입력해 주시겠어요?", 
"죄송해요. 사용법은 매뉴얼, 사용법 등으로 입력해 주세요."),

"hello" : ("Hello! 안녕하세요! 얻고 싶은 정보를 입력해 주세요. 사용법은 매뉴얼, 사용법 등으로 입력해 주세요.", 
"반갑습니다. 원하시는 정보를 입력해 주세요. 사용법은 매뉴얼, 사용법 등으로 입력해 보세요."),

"manual" : ("영화 제목, 배우, 감독, 순위, 연도, 국가를 이용해서 영화 정보를 얻을 수 있습니다.\nex) 배우 찾아줘, 영화 추천좀 해줘", 
"영화 제목으로 찾을래, 인기 있는 영화좀 등을 입력해 보세요.\n영화 제목, 배우, 감독, 순위, 연도, 국가를 이용해서 영화 정보를 얻을 수 있습니다."),

"title" : ("찾고자 하는 영화 제목을 입력해 주세요.\nex) 인질", "정보를 얻을 영화의 제목을 입력해 주세요.\nex) 인질"),

"actor" : ("찾고자 하는 영화 배우를 입력해 주세요. 배우가 출연한 영화 제목을 얻을 수 있습니다.\nex) 하정우", 
"배우가 출연한 영화 제목을 얻을 수 있어요! 영화 배우를 입력해 주세요.\nex) 하정우"),

"director" : ("찾고자 하는 영화 감독을 입력해 주세요. 영화 정보를 얻을 수 있습니다.\nex) 봉준호", 
"감독이 맡은 영화 정보를 얻을 수 있습니다. 찾고자 하는 영화 감독을 입력해주세요.\nex) 봉준호"),

"rank" : ("최근 영화 순위입니다.\n", "최근 인기있는 영화 순위입니다.\n"),

"year" : ("연도별 개봉한 영화 정보를 얻을 수 있어요. 연도를 입력해 주세요.\nex) 2021 or 2020-2021", 
"특정 연도에 개봉한 영화 정보를 얻을 수 있어요. 연도를 입력해 주세요.\nex) 2021 or 2020-2021"),

"country" : ("국가별 영화 정보를 조회할 수 있습니다. 국가를 입력해 주세요.\nex) 한국", 
"국가를 입력해 주세요. 해당 국가의 영화 정보를 얻을 수 있습니다.\nex) 한국"),

"welcome" : ("어서 오세요. 영화 정보 챗봇입니다.\n사용법은 매뉴얼, 사용법 등으로 입력해 보세요!", 
"반갑습니다. 영화 정보 챗봇입니다.\n사용법은 매뉴얼, 사용법 등으로 입력해 보세요!", 
"안녕하세요! 영화 정보 챗봇입니다.\n다양한 영화 정보를 얻으세요. 사용법은 매뉴얼, 사용법 등으로 입력해 보세요!",
"어서 오세요! 영화 정보 챗봇입니다.\n여러 영화 정보를 얻을 수 있어요! 사용법은 매뉴얼, 사용법 등으로 입력해 보세요!"),

"other" : ("다른 정보가 더 필요한가요? 얻고 싶은 정보를 입력해 주세요.\n사용법은 매뉴얼, 사용법 등으로 입력해 주시면 됩니다.",
"더 필요하신 정보는 없나요? 원하시는 다른 정보가 있으시면 입력해 주세요.\n사용법은 매뉴얼, 사용법 등으로 입력해 주시면 됩니다."),

"none" : ("죄송합니다. 찾으시는 정보가 없어요.\n입력 형식이 잘못되었거나 데이터가 존재하지 않아요.",
"죄송해요. 정보를 찾을 수 없어요.\n데이터가 존재하지 않거나 입력 형식을 확인해 주세요.",
"정보가 존재하지 않아요. 다시 한 번 확인해 주시겠어요?"),
}